# Класс Three - работа с троичной системой счисления

## Описание

Класс `Three` представляет собой реализацию работы с числами в троичной системе счисления. Он предоставляет функциональность для создания, хранения, выполнения арифметических операций и сравнения чисел в троичной системе.

## Особенности

- Хранение чисел в троичной системе счисления (цифры 0, 1, 2)
- Поддержка основных арифметических операций (сложение, вычитание)
- Операции сравнения (равно, меньше, больше)
- Несколько конструкторов для удобного создания объектов
- Автоматическое управление памятью
- Поддержка перемещающей семантики

## Интерфейс класса

### Конструкторы

```cpp
Three();                              // По умолчанию (ноль)
Three(const size_t &n, unsigned char t = 0);  // Из размера и символа
Three(const std::initializer_list<unsigned char> &t);  // Из списка инициализации
Three(const std::string &t);          // Из строки
Three(const Three &t);                // Копирования
Three(Three &&other);                 // Перемещения
```

### Методы

```cpp
void Print();                         // Вывод числа в консоль
std::string Get();                    // Получение числа в виде строки

Three Sum(const Three &t);            // Сложение
Three Sub(const Three &t);            // Вычитание

bool Equal(const Three &t);           // Проверка на равенство
bool Less(const Three &t);            // Проверка "меньше"
bool More(const Three &t);            // Проверка "больше"
```

## Примеры использования

### Создание чисел

```cpp
Three objList = Three({'1', '0', '2'});    // Из списка: 102₃
Three objEmpty = Three();                   // По умолчанию: 0₃
Three objChar = Three(1, '2');              // Из символа: 2₃
Three objString = Three("1010210");         // Из строки: 1010210₃
Three objCopy = Three(objString);           // Копирование
```

### Арифметические операции

```cpp
Three num1 = Three("12");    // 12₃ = 5₁₀
Three num2 = Three("21");    // 21₃ = 7₁₀

// Сложение
Three sumResult = num1.Sum(num2);    // 110₃ = 12₁₀
sumResult.Print();                   // Вывод: 110

// Вычитание
Three num3 = Three("21");            // 21₃ = 7₁₀
Three num4 = Three("12");            // 12₃ = 5₁₀
Three subResult = num3.Sub(num4);    // 2₃ = 2₁₀
subResult.Print();                   // Вывод: 2
```

### Операции сравнения

```cpp
Three a = Three("102");
Three b = Three("101");

if (a.More(b)) {
    std::cout << "a больше b" << std::endl;
}

if (b.Less(a)) {
    std::cout << "b меньше a" << std::endl;
}

if (a.Equal(b)) {
    std::cout << "a равно b" << std::endl;
} else {
    std::cout << "a не равно b" << std::endl;
}
```

## Сборка и тестирование

### Требования

- Компилятор C++ с поддержкой C++11
- CMake (рекомендуется)
- Google Test (для тестов)

### Сборка

```bash
mkdir build
cd build
cmake ..
make
```

### Запуск тестов

```bash
./test_three
```

### Запуск примера

```bash
./main
```

## Структура проекта

```
project/
├── src/
│   ├── three.h          // Заголовочный файл класса
│   └── three.cpp        // Реализация класса
├── tests/
│   └── test_three.cpp   // Модульные тесты
├── main.cpp             // Пример использования
└── CMakeLists.txt       // Файл конфигурации CMake
```

## Особенности реализации

- Числа хранятся в обратном порядке (младшие разряды первыми) для упрощения арифметических операций
- Автоматическое удаление ведущих нулей
- Проверка корректности входных данных
- Обработка переносов и заимствований при арифметических операциях

## Примечания

- Все операции выполняются в троичной системе счисления
- При вычитании из меньшего числа большего результат будет неопределенным (не обрабатывается отрицательный результат)
- Входные данные должны содержать только допустимые троичные цифры (0, 1, 2)
